src/utils/config/artillery/artillery-script.yml
config:
  target: https://opensource-demo.orangehrmlive.com/web/index.php/auth/login
  phases:
    - duration: 100
      arrivalRate: 1
      maxVusers: 1
  engines:
    playwright:
      showAllPageMetrics: true,
      extendedMetrics: true
      aggregateByName: true
      launchOptions:
        headless: false
  processor: ./tests/load/BrowerLoadTest.spec.js
scenarios:
  - name: "Basic Load"
    engine: playwright
    flowFunction: "browserloadTest"